int/resources/objectRepo/xmlTemplates/opera/Inventory/req_SetChannelSellLimitsByDateRange.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/inv/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:SetChannelSellLimitsByDateRangeRQ AdjustOverlappingSchedules="?" CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:SellLimits>
            <v91:SellLimit>
               <v91:SellLimitID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               <v91:HotelCode/>
               <v91:BookingChannelCode/>
               <v91:ChannelRoomType/>
               <v91:DateRange Friday="?" Monday="?" Saturday="?" Sunday="?" Thursday="?" Tuesday="?" Wednesday="?">
                  <v91:TimeSpan>
                     <v91:StartDate/>
                     <v91:EndDate/>
                     <v91:Duration/>
                  </v91:TimeSpan>
               </v91:DateRange>
               <v91:NumberOfRooms/>
            </v91:SellLimit>
         </v9:SellLimits>
      </v9:SetChannelSellLimitsByDateRangeRQ>
   </soapenv:Body>
</soapenv:Envelope>